RT-Thread/rt-thread/bsp/imxrt/imxrt1170-nxp-evk/board/board.c
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_00_SEMC_DATA00, /* GPIO_EMC_B1_00 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_01_SEMC_DATA01, /* GPIO_EMC_B1_01 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_02_SEMC_DATA02, /* GPIO_EMC_B1_02 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_03_SEMC_DATA03, /* GPIO_EMC_B1_03 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_04_SEMC_DATA04, /* GPIO_EMC_B1_04 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_05_SEMC_DATA05, /* GPIO_EMC_B1_05 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_06_SEMC_DATA06, /* GPIO_EMC_B1_06 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_07_SEMC_DATA07, /* GPIO_EMC_B1_07 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_08_SEMC_DM00, /* GPIO_EMC_B1_08 PAD functional properties : */
        0x08U);                          /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_09_SEMC_ADDR00, /* GPIO_EMC_B1_09 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_10_SEMC_ADDR01, /* GPIO_EMC_B1_10 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_11_SEMC_ADDR02, /* GPIO_EMC_B1_11 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_12_SEMC_ADDR03, /* GPIO_EMC_B1_12 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_13_SEMC_ADDR04, /* GPIO_EMC_B1_13 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_14_SEMC_ADDR05, /* GPIO_EMC_B1_14 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_15_SEMC_ADDR06, /* GPIO_EMC_B1_15 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_16_SEMC_ADDR07, /* GPIO_EMC_B1_16 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_17_SEMC_ADDR08, /* GPIO_EMC_B1_17 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_18_SEMC_ADDR09, /* GPIO_EMC_B1_18 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_19_SEMC_ADDR11, /* GPIO_EMC_B1_19 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_20_SEMC_ADDR12, /* GPIO_EMC_B1_20 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_21_SEMC_BA0, /* GPIO_EMC_B1_21 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_22_SEMC_BA1, /* GPIO_EMC_B1_22 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_23_SEMC_ADDR10, /* GPIO_EMC_B1_23 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_24_SEMC_CAS, /* GPIO_EMC_B1_24 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_25_SEMC_RAS, /* GPIO_EMC_B1_25 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_26_SEMC_CLK, /* GPIO_EMC_B1_26 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_27_SEMC_CKE, /* GPIO_EMC_B1_27 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_28_SEMC_WE, /* GPIO_EMC_B1_28 PAD functional properties : */
        0x08U);                        /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_29_SEMC_CS0, /* GPIO_EMC_B1_29 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_30_SEMC_DATA08, /* GPIO_EMC_B1_30 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_31_SEMC_DATA09, /* GPIO_EMC_B1_31 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_32_SEMC_DATA10, /* GPIO_EMC_B1_32 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_33_SEMC_DATA11, /* GPIO_EMC_B1_33 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_34_SEMC_DATA12, /* GPIO_EMC_B1_34 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_35_SEMC_DATA13, /* GPIO_EMC_B1_35 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_36_SEMC_DATA14, /* GPIO_EMC_B1_36 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_37_SEMC_DATA15, /* GPIO_EMC_B1_37 PAD functional properties : */
        0x08U);                            /* PDRV Field: high drive strength
                                                Pull Down Pull Up Field: Internal pulldown resistor enabled
                                                Open Drain Field: Disabled
                                                Domain write protection: Both cores are allowed
                                                Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_38_SEMC_DM01, /* GPIO_EMC_B1_38 PAD functional properties : */
        0x08U);                          /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_39_SEMC_DQS, /* GPIO_EMC_B1_39 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_40_SEMC_RDY, /* GPIO_EMC_B1_40 PAD functional properties : */
        0x08U);                         /* PDRV Field: high drive strength
                                            Pull Down Pull Up Field: Internal pulldown resistor enabled
                                            Open Drain Field: Disabled
                                            Domain write protection: Both cores are allowed
                                            Domain write protection lock: Neither of DWP bits is locked */
    IOMUXC_SetPinConfig(
        IOMUXC_GPIO_EMC_B1_41_SEMC_CSX00, /* GPIO_EMC_B1_41 PAD functional properties : */
        0x08U);                           /* PDRV Field: high drive strength
